# ShowContourLines Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayColoredSurfaceSettings..::..ShowContourLines Property
AnalysisDisplayColoredSurfaceSettings Class See Also
---
If true, show contour lines in the analysis display.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool ShowContourLines { get; set; }
```

Visual Basic
---
```text
Public Property ShowContourLines As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool ShowContourLines {
	bool get ();
	void set (bool value);
}
```

# See Also
AnalysisDisplayColoredSurfaceSettings Class
Autodesk.Revit.DB.Analysis Namespace